house = Array.new(3, Array.new(3, 0)) #2次元配列作成(デフォ値 = ０)
p house                  #=> [[0, 0, 0], [0, 0, 0], [0, 0, 0]]
house[0][0] = 1
p house                  #=> [[1, 0, 0], [1, 0, 0], [1, 0, 0]] → 2,3番の要素も変更?
p house.map(&:object_id) #=> [70353577654880, 70353577654880, 70353577654880]

house2 = Array.new(3).map{Array.new(3, 0)} #2次元配列作成(デフォ値 = ０)
p house2                  #=> [[0, 0, 0], [0, 0, 0], [0, 0, 0]]
house2[0][0] = 1
p house2                  #=> [[1, 0, 0], [0, 0, 0], [0, 0, 0]]
p house2.map(&:object_id) #=> [70282811355920, 70282811355900, 70282811355880]